t
game
team
will
hockey
play
games
season
period
don
year
la
pit
nhl
st
players
det
goal
pts
win
time
gm
good
bos
well
league
tor
chi
player
teams
van
series
second
nyi
power
detroit
nj
buf
played
espn
shots
stl
pittsburgh
leafs
cal
best
points
flyers
puck
nyr
ice
buffalo
boston
rangers
playoffs
goals
cup
min
john
chicago
great
toronto
people
blues
better
division
going
bruins
playoff
night
didn
mike
april
years
third
islanders
fans
montreal
calgary
scoring
sabres
canada
vancouver
kings
devils
mon
pens
wings
ve
coach
shot
phi
edm
playing
quebec
draft
won
flames
pick
ll
point
mark
lemieux
winnipeg
round
sharks
pt
penalty
sj
louis
net
jets
minnesota
city
lindros
bad
hawks
tb
scorer
saves
mtl
final
san
usa
jersey
lot
leads
left
scored
gilmour
ny
goalie
baseball
ott
post
sure
caps
steve
dave
sweden
har
three
conference
watch
top
philadelphia
stars
fuhr
hartford
penguins
washington
patrick
penalties
guy
roger
red
doesn
brian
defense
lost
edmonton
article
record
regular
jose
score
traded
mail
news
fan
wsh
ot
jagr
oilers
moncton
lead
finland
bay
north
long
bob
gretzky
list
ahl
center
soderstrom
peter
stanley
joseph
abc
beat
coverage
andrew
big
high
winner
tv
defenseman
canucks
ron
murray
ottawa
angeles
los
wasn
recchi
francis
move
times
finals
remember
thought
stats
captain
tampa
deal
overtime
isn
arena
blue
rochester
hard
baltimore
pat
springfield
stevens
canadian
providence
roy
pretty
thing
things
isles
winning
brown
keep
club
paul
dineen
murphy
rick
mario
sports
course
utica
stick
money
maple
scott
germany
number
ulf
hfd
zone
bill
joe
standings
tie
smith
agree
adirondack
selanne
chance
binghamton
american
potvin
started
heard
sport
wpg
hull
al
man
eric
sunday
york
minutes
start
cgy
lw
defensive
amour
ago
opportunities
hit
couple
group
rob
brind
young
call
mogilny
day
russia
norris
wins
habs
head
breton
cape
chris
bure
total
thomas
doug
sanderson
hope
place
guess
face
shanahan
tommy
early
true
kevin
david
send
minute
lafontaine
canadiens
major
courtnall
mullen
fredericton
rw
att
sh
adams
local
close
trade
powerplay
tocchet
reason
pass
maine
late
tied
ray
called
week
kind
fleury
feel
find
jeff
apr
galley
belfour
king
bobby
blackhawks
pool
guys
switzerland
watching
finally
czech
njd
president
contract
gary
expansion
dallas
goaltender
real
fact
messier
cs
championships
national
en
names
plays
sutter
minor
work
couldn
side
ga
chelios
acquired
ihl
coffey
smythe
star
rest
cherry
nice
pitt
barrasso
hell
wayne
neely
italy
wrong
seconds
cdi
looked
job
gp
grant
future
tom
european
yzerman
senators
university
slot
pim
miller
making
fighting
finnish
help
average
whalers
goalies
problem
asked
probert
wouldn
hunter
turgeon
current
keith
jim
haven
front
read
scores
clark
oates
hawerchuk
norway
andersson
keenan
stupid
biggest
sandstrom
bowman
poulin
republic
free
pocklington
set
capitals
mind
hextall
announced
yeah
janney
picked
bit
days
save
rookie
loss
greg
radio
wing
schedule
college
victory
france
coming
lose
talent
linden
grade
eklund
today
wanted
cheap
gainey
east
injury
state
leaf
carson
percentage
numbers
kariya
ferraro
halifax
austria
injuries
americans
referee
check
franchise
ronning
simply
juneau
nylander
level
area
short
echl
advantage
