t
god
people
don
will
atheism
religion
well
jesus
time
atheists
evidence
argument
true
good
point
bible
belief
religious
example
atheist
read
ve
things
article
system
question
islam
book
fact
claim
course
life
doesn
moral
christian
exist
faith
thing
reason
case
person
wrong
find
agree
isn
statement
existence
post
beliefs
better
morality
human
alt
theism
science
real
matthew
sure
society
based
sense
thought
years
ll
answer
long
islamic
objective
truth
law
exists
free
fallacy
gods
understand
nature
man
didn
word
history
matter
day
faq
simply
christians
men
christianity
problem
posting
mind
books
set
universe
work
idea
claims
arguments
conclusion
false
logic
qur
war
position
strong
discussion
statements
bad
feel
going
group
note
accept
definition
state
subject
great
clear
religions
best
theists
rushdie
number
making
general
natural
support
view
death
church
stuff
john
prove
questions
bill
values
explain
news
deleted
energy
muslim
proof
wouldn
consider
earth
humans
correct
hold
written
rest
interesting
personal
theory
context
opinion
bobby
knowledge
hard
times
original
muslims
power
asked
meaning
form
send
evolution
kill
situation
assume
women
called
david
event
lot
considered
basis
second
lack
place
social
morals
sex
mark
hand
perfect
response
love
issue
talking
exactly
sort
kind
text
call
created
instance
live
king
american
reading
days
bit
follow
keep
government
help
evil
version
jews
list
quote
believed
three
change
satan
rational
freedom
story
care
prophecy
told
laws
logical
observations
apr
purpose
difference
punishment
actions
talk
big
valid
haven
absolute
believing
prophet
order
start
doubt
define
nation
generally
answers
control
newsgroup
liar
lord
rules
argue
stay
hear
tells
thinking
hope
mail
deletion
jewish
heard
individual
thread
money
won
assertion
simple
premise
wrote
die
anti
mentioned
bob
jim
debate
rule
scientific
verses
clearly
defined
assumption
weak
events
secular
vice
reasonable
sea
kent
posts
interpretation
subjective
irrational
majority
obvious
killing
supposed
remember
common
species
source
systems
peace
uk
murder
attempt
hell
object
ideas
wonder
ago
consistent
write
pretty
articles
guess
tek
messiah
hitler
terms
premises
reasons
usenet
cobb
wasn
suppose
died
action
high
james
problems
ico
behaviour
worse
ad
large
fit
hypothesis
choice
expect
tend
allow
alternative
reality
couldn
killed
cheers
physical
entirely
force
children
early
positive
christ
bank
states
accepted
bobbe
level
br
population
behavior
animals
involved
nice
language
leave
ignore
verse
disagree
stories
including
speak
described
discuss
isaiah
process
disciples
judge
assuming
stated
beauchaine
include
result
country
allah
consequences
reference
today
copy
possibility
khomeini
revelation
family
understanding
files
university
divine
short
press
happen
face
mary
easily
koresh
term
eternal
israel
surely
apply
blew
believes
full
contradiction
poor
countries
reasoning
issues
directly
caused
led
writing
de
argumentum
psalm
theist
open
military
luke
head
scientists
presented
`
completely
decide
mention
manhattan
sank
bronx
queens
frank
motivated
aware
innocent
immoral
fine
concept
opinions
lives
holy
imagine
claiming
fall
area
earlier
side
groups
dogma
analogy
sources
homosexuality
reliable
implies
posted
interest
totally
speaking
fanatism
contradictory
realize
creation
takes
fear
ways
code
claimed
rights
justification
catholic
easy
woman
rh
passage
usa
happened
author
reply
testament
son
deal
postings
total
left
impossible
risk
error
basic
year
acceptable
silly
intended
require
higher
