t
people
armenian
armenians
israel
turkish
jews
will
don
israeli
jewish
government
time
arab
well
turkey
war
armenia
children
killed
turks
didn
state
genocide
years
muslim
azerbaijan
russian
history
muslims
greek
university
soldiers
going
population
fact
soviet
told
rights
left
women
human
three
started
ve
arabs
ottoman
anti
villages
dead
istanbul
peace
adl
palestinian
men
army
country
called
group
azerbaijani
ll
greece
press
land
long
city
year
policy
case
political
serdar
today
argic
military
law
police
states
apartment
times
things
day
number
party
point
troops
work
kuwait
palestinians
heard
find
professor
kill
nazi
general
source
building
happened
article
question
place
man
course
village
american
azeri
good
baku
international
help
town
york
sumgait
door
true
national
thought
couldn
second
massacre
karabakh
live
religious
father
asked
power
person
republic
read
countries
palestine
problem
empire
mamma
united
british
lived
sure
leave
life
foreign
great
remember
area
civilians
occupied
side
forces
call
small
greeks
bullock
members
killing
public
published
bodies
attack
kurds
western
death
europe
ankara
security
israelis
house
third
brought
neighbors
east
nazis
days
force
return
book
living
azerbaijanis
head
gaza
eastern
paragraph
ethnic
iran
son
claim
face
including
open
groups
hand
attacks
arms
order
support
mother
citizens
report
fighting
better
office
shot
serbs
religion
london
west
wife
keep
based
bosnia
entire
issue
center
situation
territories
jew
real
henrik
family
bosnian
woman
ago
region
middle
blood
hope
fire
daughter
thing
committee
april
subject
leaders
ar
eyes
began
news
lebanon
wanted
post
nation
rest
gerard
cyprus
matter
local
territory
talk
march
official
thousands
documents
freedom
adam
set
cut
community
lebanese
school
statement
answer
occupation
terrorism
understand
lives
german
holocaust
azeris
conflict
young
night
century
independence
karabagh
bad
alive
example
burned
god
control
front
president
died
jerusalem
refugees
knew
reason
road
feel
victims
happen
lot
involved
destroyed
crowd
car
islamic
nations
inhabitants
reports
independent
evidence
agree
murder
coming
turned
shouting
nagorno
islam
wrong
kind
start
tartars
slaughter
committed
movement
room
afraid
free
hate
talking
story
word
minority
christian
ii
full
events
hands
floor
february
hear
tartar
percent
simply
civil
massacres
iraq
looked
ground
sdpa
homeland
germany
carried
bm
karina
ermeni
south
armed
dr
border
organization
wasn
idea
culture
mind
wounded
minister
race
zionist
turkiye
balcony
large
turk
al
san
reported
california
standing
murdered
russia
european
weapons
dro
actions
solution
save
claims
francisco
fight
completely
innocent
half
close
erzurum
wouldn
neighbor
hospital
terrorist
sources
street
action
account
moslem
officer
position
major
organizations
asala
borders
doesn
months
island
rule
problems
attempt
exactly
clearly
wrote
authorities
body
form
change
truth
received
corpses
girls
list
guy
bus
council
posting
member
held
hours
december
system
syria
igor
attacked
washington
organized
places
parties
die
clear
making
extermination
view
arf
kurdish
historical
zionism
attacking
society
worked
morning
born
stay
crime
questions
angeles
los
care
atrocities
ira
osmanli
van
won
hard
best
fled
agdam
french
existence
union
modern
gulf
russians
isn
facts
opinion
books
christians
criminal
struggle
lies
result
homes
lying
anatolia
lost
relations
speak
racist
stated
kk
cold
final
accept
allowed
sides
lyuda
``
bank
court
led
beat
reference
racial
lands
bullets
